---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHandlePositionData.GetNumberOfBars
source: html/f6f1acfa-c7b8-bda2-1994-f1475601c75f.htm
---
# Autodesk.Revit.DB.Structure.RebarHandlePositionData.GetNumberOfBars Method

Gets the number of bars currently in the rebar.

## Syntax (C#)
```csharp
public int GetNumberOfBars()
```

## Returns
Returns the number of bars currently in the rebar.